app/controllers/my_blogs_controller.rb

SELECT "my_blogs".* FROM "my_blogs"
---
  def index
    @my_blogs = MyBlog.all

INSERT INTO "my_blogs" ("title", "text", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Yzel's Blog on Rails"], ["text", "Learnings shared by Pat"], ["created_at", "2018-10-26 06:37:59.467539"], ["updated_at", "2018-10-26 06:37:59.467539"]]
---
  def create
    @my_blog = MyBlog.new(my_blog_params)

    respond_to do |format|
      if @my_blog.save

UPDATE "my_blogs" SET "title" = ?, "text" = ?, "updated_at" = ? WHERE "my_blogs"."id" = ?
---
  def update
    respond_to do |format|
      if @my_blog.update(my_blog_params)

SELECT  "my_blogs".* FROM "my_blogs" WHERE "my_blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_my_blog
      @my_blog = MyBlog.find(params[:id])